---
kind: type
id: T:Autodesk.Revit.DB.Electrical.PanelScheduleType
source: html/68aea073-b430-27da-74e9-29786610476b.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleType

This enum declares the panel schedule type.

## Syntax (C#)
```csharp
public enum PanelScheduleType
```